proracun/best/best/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "300";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
12100
(
(0.179553 -0.029528 5.14713e-19)
(0.457332 0.0964253 -6.11836e-19)
(0.642114 0.131737 2.05733e-19)
(0.73546 0.124454 3.44414e-19)
(0.760077 0.124155 -3.14454e-19)
(0.759627 0.125609 2.61746e-19)
(0.751839 0.129622 -2.47103e-19)
(0.738581 0.135737 0)
...
)
;

boundaryField
{
    down
    {
        type            slip;
    }
    right
    {
        type            zeroGradient;
    }
    up
    {
        type            slip;
    }
    left
    {
        type            uniformFixedValue;
        uniformValue    constant (0.5 0 0);
        value           uniform (0.5 0 0);
    }
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
