proracun/best/best/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
12100
(
-0.192787
-0.164173
-0.158358
-0.158673
-0.150547
-0.142054
-0.133253
-0.123986
...
)
;

boundaryField
{
    down
    {
        type            slip;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    up
    {
        type            slip;
    }
    left
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
