proracun/best/best/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "300";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23970
(
0.0233877
-0.00370249
-0.0196852
0.0459512
0.0122507
-0.0348143
0.060248
0.0265275
...
)
;

boundaryField
{
    down
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
0.895067
0.895108
0.89519
0.89531
0.895471
0.895666
0.895901
0.896161
...
)
;
    }
    up
    {
        type            calculated;
        value           uniform 0;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
-0.875
-0.875
-0.875
-0.875
-0.875
-0.875
-0.875
-0.875
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
