proracun/best/best/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
    #};

    code
    #{
        pointField points(20);
        points[0]  = point(1.4142135623730951, 1.414213562373095, -0.5);
        points[1]  = point(-1.414213562373095, 1.4142135623730951, -0.5);
        points[2]  = point(-1.414213562373095, -1.4142135623730951, -0.5);
        points[3]  = point(1.4142135623730951, -1.414213562373095, -0.5);
        points[4]  = point(15.0, 15.0, -0.5);
        points[5]  = point(-15.0, 15.0, -0.5);
        points[6]  = point(-15.0, -15.0, -0.5);
        points[7]  = point(15.0, -15.0, -0.5);
        points[8]  = point(115.0, 50.0, -0.5);
        points[9]  = point(15.0, 50.0, -0.5);
        points[10]  = point(-15.0, 50.0, -0.5);
        points[11]  = point(-45.0, 50.0, -0.5);
        points[12]  = point(-45.0, 15.0, -0.5);
        points[13]  = point(-45.0, -15.0, -0.5);
        points[14]  = point(-45.0, -50.0, -0.5);
        points[15]  = point(-15.0, -50.0, -0.5);
        points[16]  = point(15.0, -50.0, -0.5);
        points[17]  = point(115.0, -50.0, -0.5);
        points[18]  = point(115.0, -15.0, -0.5);
        points[19]  = point(115.0, 15.0, -0.5);
        
        // Duplicate z points
        label sz = points.size();
        points.setSize(2*sz);
        for (label i = 0; i < sz; i++)
        {
            const point& pt = points[i];
            points[i+sz] = point(pt.x(), pt.y(), -pt.z());
        }

        os  << points;
    #};
};


blocks
(
    hex (3 7 4 0 23 27 24 20) (50 30 1) edgeGrading (20 1 1)
    hex (0 4 5 1 20 24 25 21) (50 30 1) edgeGrading (20 1 1)
    hex (2 1 5 6 22 21 25 26) (30 50 1) edgeGrading (1 20 1)
    hex (2 6 7 3 22 26 27 23 22) (50 30 1) edgeGrading (20 1 1)
    hex (12 5 10 11 32 25 30 31) (20 20 1) simpleGrading (1 1 1)
    hex (5 4 9 10 25 24 29 30) (30 20 1) simpleGrading (1 1 1)
    hex (4 19 8 9 24 39 28 29) (50 20 1) simpleGrading (1 1 1)
    hex (13 6 5 12 33 26 25 32) (20 30 1) simpleGrading (1 1 1)
    hex (7 18 19 4 27 38 39 24) (50 30 1) simpleGrading (1 1 1)
    hex (14 15 6 13 34 35 26 33) (20 20 1) simpleGrading (1 1 1)
    hex (15 16 7 6 35 36 27 26) (30 20 1) simpleGrading (1 1 1)
    hex (16 17 18 7 36 37 38 27) (50 20 1) simpleGrading (1 1 1)
);

edges
(
    spline 0 3 ((1.618033988749895 1.1755705045849463 -0.5) (1.7820130483767358 0.9079809994790935 -0.5) (1.902113032590307 0.6180339887498948 -0.5) (1.9753766811902755 0.31286893008046174 -0.5) (2.0 0.0 -0.5) (1.9753766811902755 -0.31286893008046174 -0.5) (1.902113032590307 -0.6180339887498948 -0.5) (1.7820130483767358 -0.9079809994790935 -0.5) (1.618033988749895 -1.1755705045849463 -0.5))
    spline 0 1 ((1.198555333022694 1.6010824818487208 -0.5) (0.9584979734401137 1.7553579791345113 -0.5) (0.6989283591981968 1.8738994499995234 -0.5) (0.4251305791059532 1.954293731942319 -0.5) (0.1426783663984647 1.994904229220507 -0.5) (-0.14267836639846448 1.994904229220507 -0.5) (-0.425130579105953 1.954293731942319 -0.5) (-0.6989283591981966 1.8738994499995234 -0.5) (-0.9584979734401138 1.755357979134511 -0.5) (-1.198555333022694 1.6010824818487208 -0.5))
    spline 1 2 ((-1.6180339887498947 1.1755705045849465 -0.5) (-1.7820130483767356 0.9079809994790937 -0.5) (-1.902113032590307 0.618033988749895 -0.5) (-1.9753766811902753 0.31286893008046196 -0.5) (-2.0 2.4492935982947064e-16 -0.5) (-1.9753766811902753 -0.31286893008046196 -0.5) (-1.902113032590307 -0.618033988749895 -0.5) (-1.7820130483767356 -0.9079809994790937 -0.5) (-1.6180339887498947 -1.1755705045849465 -0.5))
    spline 2 3 ((-1.198555333022694 -1.6010824818487208 -0.5) (-0.9584979734401138 -1.755357979134511 -0.5) (-0.6989283591981966 -1.8738994499995234 -0.5) (-0.425130579105953 -1.954293731942319 -0.5) (-0.14267836639846448 -1.994904229220507 -0.5) (0.1426783663984647 -1.994904229220507 -0.5) (0.4251305791059532 -1.954293731942319 -0.5) (0.6989283591981968 -1.8738994499995234 -0.5) (0.9584979734401137 -1.7553579791345113 -0.5) (1.198555333022694 -1.6010824818487208 -0.5))
    spline 20 23 ((1.618033988749895 1.1755705045849463 0.5) (1.7820130483767358 0.9079809994790935 0.5) (1.902113032590307 0.6180339887498948 0.5) (1.9753766811902755 0.31286893008046174 0.5) (2.0 0.0 0.5) (1.9753766811902755 -0.31286893008046174 0.5) (1.902113032590307 -0.6180339887498948 0.5) (1.7820130483767358 -0.9079809994790935 0.5) (1.618033988749895 -1.1755705045849463 0.5))
    spline 20 21 ((1.198555333022694 1.6010824818487208 0.5) (0.9584979734401137 1.7553579791345113 0.5) (0.6989283591981968 1.8738994499995234 0.5) (0.4251305791059532 1.954293731942319 0.5) (0.1426783663984647 1.994904229220507 0.5) (-0.14267836639846448 1.994904229220507 0.5) (-0.425130579105953 1.954293731942319 0.5) (-0.6989283591981966 1.8738994499995234 0.5) (-0.9584979734401138 1.755357979134511 0.5) (-1.198555333022694 1.6010824818487208 0.5))
    spline 21 22 ((-1.6180339887498947 1.1755705045849465 0.5) (-1.7820130483767356 0.9079809994790937 0.5) (-1.902113032590307 0.618033988749895 0.5) (-1.9753766811902753 0.31286893008046196 0.5) (-2.0 2.4492935982947064e-16 0.5) (-1.9753766811902753 -0.31286893008046196 0.5) (-1.902113032590307 -0.618033988749895 0.5) (-1.7820130483767356 -0.9079809994790937 0.5) (-1.6180339887498947 -1.1755705045849465 0.5))
    spline 22 23 ((-1.198555333022694 -1.6010824818487208 0.5) (-0.9584979734401138 -1.755357979134511 0.5) (-0.6989283591981966 -1.8738994499995234 0.5) (-0.425130579105953 -1.954293731942319 0.5) (-0.14267836639846448 -1.994904229220507 0.5) (0.1426783663984647 -1.994904229220507 0.5) (0.4251305791059532 -1.954293731942319 0.5) (0.6989283591981968 -1.8738994499995234 0.5) (0.9584979734401137 -1.7553579791345113 0.5) (1.198555333022694 -1.6010824818487208 0.5))
);

boundary
(
    down
    {
        type wall;
        faces
        (
            (14 15 35 34)
     	    (15 16 36 35)
            (16 17 37 36)
        );
    }
    right
    {
        type patch;
        faces
        (
            (18 17 37 38)
            (19 18 38 39)
            (8 19 39 28)
        );
    }
    up
    {
        type wall;
        faces
        (
            (8 9 29 28)
            (9 10 30 29)
            (10 11 31 30)
        );
    }
    left
    {
        type patch;
        faces
        (
            (11 12 32 31)
            (12 13 33 32)	    
            (13 14 34 33)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (1 0 20 21)
            (2 1 21 22)
            (3 2 22 23)
            (3 0 20 23)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
