proracun/best/best/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   300;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    #include "residuals"
        
    forcesIncompressible
    {
        type            forcesIncompressible;
        functionObjectLibs ( "libforces.so" );
        writetControl   timeStep;
        writeInterval  100;

        patches
        (
            cylinder
        );

        pName       p;
        UName       U;
	rho	    rhoInf;
        log         true;
        rhoInf      1000;
        CofR        (0 0 0);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        pitchAxis   (0 0 1);
        lRef        4;
        ARef        3.8997116487272945;
        
    #includeEtc "caseDicts/postProcessing/forces/forces.cfg"
    }
}


// ************************************************************************* //
