proracun/best/best/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |  
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      residuals;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

residuals
{
    fields ( p U );

    #includeEtc "caseDicts/postProcessing/numerical/residuals.cfg"
}

// ************************************************************************* //
